Revit 2024 API
AnalyticalElement.StructuralRole Property
 The enum value depicting structural role asigned to the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public AnalyticalStructuralRole StructuralRole { get; set; }
Visual Basic
Public Property StructuralRole As AnalyticalStructuralRole
	Get
	Set
Visual C++
public:
property AnalyticalStructuralRole StructuralRole {
	AnalyticalStructuralRole get ();
	void set (AnalyticalStructuralRole value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The provided AnalyticalStructuralRole is not supported
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace